/*定时器外部中断*/

/* 中断允许寄存器
EA:  中断允许总控制位
ES:  串口中断允许位
ET1: 定时器T1中断允许位
ES1: 外部中断1允许位
ET0: 定时器T0中断允许位
ES0: 外部中断0允许位
*/

/*中断编号&优先级
        中断源    |      编号
    外部中断INT0          0
       定时器T0           1
    外部中断INT1          2
       定时器T1           3
   串口通信中断R1或T1      4
*/

#include<reg51.h>

sbit LED = P1^0;

void main()
{
    EA = 1;       //中断允许总控制位
    ET1 = 1;      //定时器T1寄存器控制位
    TMOD = 0x10;
    TH1 = (65535 - 50000)/256;
    TL1 = (65535 - 50000)%256;
    TR1 = 1;
    while(1);
}

void time() interrupt 3   //（中断函数格式 interrupt + 中断编号 ）
{
    LED = ~LED;
    TH1 = (65535 - 50000)/256;
    TL1 = (65535 - 50000)%256;
}